Silicon-Signals/stm32u5g9j-dk2-lvgl-benchmark/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "jpeg_utils_conf.h"
#include "cmsis_os2.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "lvgl_port.h"
#include "lvgl/lvgl.h"
#include "lvgl/demos/lv_demos.h"
#include "lvgl/examples/lv_examples.h"
#include "main_scr.h"
#include "avi_parser.h"
#include "output_mjpeg_800x480.h"
#include "output_mjpeg_320x240.h"
#include "string.h"
#include "stdio.h"
#include "video_demo.h"
#include "jpeg_utils.h"
#include "parameter_display.h"
#include "stm32u5xx.h"
#include "mx66uw1g45g.h"

avi_t avi;
int video = 1;
static lv_obj_t *video_screen = NULL;
static lv_obj_t *video_img = NULL;
static lv_timer_t *close_timer = NULL;

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define video_h  800
#define video_w  480
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

DCACHE_HandleTypeDef hdcache1;
DCACHE_HandleTypeDef hdcache2;

DMA2D_HandleTypeDef hdma2d;

GPU2D_HandleTypeDef hgpu2d;

XSPI_HandleTypeDef hxspi1;

I2C_HandleTypeDef hi2c2;

JPEG_HandleTypeDef hjpeg;
DMA_HandleTypeDef handle_GPDMA1_Channel1;
DMA_HandleTypeDef handle_GPDMA1_Channel0;

LTDC_HandleTypeDef hltdc;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void SystemPower_Config(void);
void MX_FREERTOS_Init(void);
static void MX_GPIO_Init(void);
static void MX_GPDMA1_Init(void);
static void MX_ICACHE_Init(void);
static void MX_DCACHE1_Init(void);
static void MX_DCACHE2_Init(void);
static void MX_CRC_Init(void);
static void MX_LTDC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_GPU2D_Init(void);
static void MX_HSPI1_Init(void);
static void MX_I2C2_Init(void);
static void MX_JPEG_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
//__attribute__((section(".ExtFlashSection"))) uint8_t rgb_buffer[800 * 480 * 2];
static void hide_video_screen_cb(lv_timer_t *timer)
{
    // Initialize parameter screen
    static_param_screen_init("Video test", "28", "12 KB", "78 KB", "0.5 ms", "15 %");

    // Delete video screen and free memory
    if (video_screen) {
        lv_obj_del(video_screen);
        video_screen = NULL;
        video_img = NULL;
    }

    // Delete timer itself
    if (timer) {
        lv_timer_del(timer);
    }

    close_timer = NULL;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the System Power */
  SystemPower_Config();

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_GPDMA1_Init();
  MX_ICACHE_Init();
  MX_DCACHE1_Init();
  MX_DCACHE2_Init();
  MX_CRC_Init();
  MX_LTDC_Init();
  MX_DMA2D_Init();
  MX_GPU2D_Init();
  MX_HSPI1_Init();
  MX_I2C2_Init();
  MX_JPEG_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */

  lvgl_port_init();
  lv_obj_t * out = main_screen_start();
  lv_scr_load(out);
  /* USER CODE END 2 */

  /* Init scheduler */
//  osKernelInitialize();
//
//  /* Call init function for freertos objects (in cmsis_os2.c) */
//  MX_FREERTOS_Init();
//
//  /* Start scheduler */
//  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */


	  lv_timer_handler();
	  HAL_Delay(1);

	  if (video == 0)
	  {
		  // Reset flag to avoid re-entry
		  video = 1;

		  // --- Create new video screen ---
	      video_screen = lv_obj_create(NULL);
	      lv_screen_load(video_screen);
	      lv_obj_set_style_bg_color(video_screen, lv_color_white(), 0);

	      // Initialize JPEG tables (important for STM32 JPEG hardware)
	      JPEG_InitColorTables();

	      // Initialize AVI file
	      if (avi_init(&avi, output_mjpeg_800x480_avi, output_mjpeg_800x480_avi_len) != 0) {
	    	  lv_obj_t *label = lv_label_create(video_screen);
	    	  lv_label_set_text(label, "AVI Init Failed");
	    	  lv_obj_center(label);
	    	  HAL_UART_Transmit(&huart1, (uint8_t *)"AVI Init Failed\r\n", 16, 100);
	    	  continue;
	      }

	      char log[64];
	      snprintf(log, sizeof(log), "AVI: %ldx%ld, %ld frames, %ld FPS\r\n",
	                   avi.width, avi.height, avi.frame_count, avi.fps);
	      HAL_UART_Transmit(&huart1, (uint8_t *)log, strlen(log), 100);

